{"title":"Learn from Kpop Female Groups","date":"2021-04-11T07:50:32.000Z","date_formatted":{"ll":"Apr 11, 2021","L":"04/11/2021","MM-DD":"04-11"},"link":"2021/04/11/kpopgroup","tags":["Kpop"],"updated":"2021-12-14T08:01:42.543Z","content":"<p>#1. Brave Girls-Be Brave<br>\nI was shocked when I woke up on March 4 and saw “Rollin” trending on the top sector of Weibo. When I clicked the hashtag, a video popped up. I couldn’t believe it was exactly the song I listened to almost four years ago. As a 13-year Kpop lover, I always follow the latest music trends and check every week’s latest performance stages. Hundreds of groups debuted in South Korea every year, and numerous songs came out, but most of them only went nameless. The song “Rollin” was one of those unknown songs.<br>\n<img src=\"/.com//bg1.jpg\" alt=\"bg1\" loading=\"lazy\"><br>\n(The original concept of “Rollin” is Sexy)</p>\n<p>A YouTuber named “비디터ᴠɪᴅɪᴛᴏʀ” edited Brave Girls’ live stages and combined it with interactive comments under those performance videos. He of she uploaded it on February 24. A few days later, more and more people gathered. Most of them have served in South Korea’s army before.<br>\nThousands of South Korean soldiers loved this song mainly because of Brave Girls’ endless effort and their passion for the stage.<br>\nPerforming in the military is an energy-consuming job with little salary but long-time travel. Most of the famous female groups only attended no more than three shows. However, BraveGirls attended almost all of them. Their longest journey took 12 hours, and the payback was less than $80. Despite the difficulties, every time, Brave Girls smiled and enjoyed the performance “as if it’s the last.”<br>\nFor example, to perform the song “Rollin”, everyone should dance on a chair. One time, the group member Yuna fell from the chair during the performance. She quickly got up and stood on the chair again, perfectly finishing the song.<br>\n<img src=\"/.com//bg2.jpg\" alt=\"bg2\" loading=\"lazy\"></p>\n","prev":{"title":"Life Expectancy","link":"2021/10/30/My-New-Post"},"plink":"http://example.com/2021/04/11/kpopgroup/","reading_time":"293 words in 2 min"}