{"title":"2022 To-do-list","date":"2022-01-01T08:09:30.000Z","date_formatted":{"ll":"Jan 1, 2022","L":"01/01/2022","MM-DD":"01-01"},"thumbnail":"2022/01/01/2022/newyear.jpg","link":"2022/01/01/2022","tags":["HANN"],"updated":"2022-01-04T07:27:12.014Z","content":"<p>Happy New Year!<br>\nCan’t imagine it’s 2022 already.<br>\nHere’s my current 2022 To-do-list.</p>\n<hr>\n<ol>\n<li>Learning Spanish</li>\n</ol>\n<p>So far, much fun! I hope one day hope I can communicate with my Spanish friends in simple Spanish next time we meet.</p>\n<ol start=\"2\">\n<li>Taking extra courses on edX</li>\n</ol>\n<p>I learned some courses on Python on Coursera during the quarantine and am on my way to exploring this platform now. I’m taking classes like Collaborative Data Science for Healthcare and Machine Learning with Python from Linear Models to Deep Learning.<br>\nI hope that could make up for some gap between other students who began learning CS since undergraduate. My robust mathematics knowledge truly helped me a lot these months. Maybe that’s why my high school forced us to learn calculus and participate in Mathematical Olympiad. Glad my effort finally paid off after six years.</p>\n<p><img src=\"images/22/edx.jpg\" alt=\"edX\" loading=\"lazy\" class=\"φbp\"></p>\n<ol start=\"3\">\n<li>Life-time friend: Dancing and singing</li>\n</ol>\n<p>It’s a bit pity that I didn’t get so much time to learn new songs or dances last semester because I need to devote more time to my schoolwork. It’s great to have time for them during the winter break.</p>\n<ol start=\"4\">\n<li>Volunteer: Help more people like before</li>\n</ol>\n<p>I applied for the  Massachusetts General Hospital volunteer. Hope I could be admitted sooner or later.</p>\n<hr>\n<p><em>Wishlist</em></p>\n<ol>\n<li>\n<p>Hope my mom can recover soon. It’s lucky to have Harvard medical students as my roommates, they truly helped me a lot.</p>\n</li>\n<li>\n<p>Hope there will be good news that I’m admitted in the near future. I genuinely want to study further :(</p>\n</li>\n</ol>\n<hr>\n<p>Most importantly: always love yourself and be kind to others.</p>\n<p><em>Adios</em></p>\n","next":{"title":"HANN's Daily Life","link":"2021/12/18/private"},"plink":"http://example.com/2022/01/01/2022/","reading_time":"282 words in 2 min"}