{"title":"Biography of HANN","date":"2021-09-10T05:13:55.000Z","date_formatted":{"ll":"Sep 10, 2021","L":"09/10/2021","MM-DD":"09-10"},"thumbnail":"2021/09/10/aboutme/aboutme.jpg","link":"2021/09/10/aboutme","tags":["HANN"],"updated":"2022-01-04T07:28:24.667Z","content":"<p>HANN - A Marketing Researcher with Data Analysis background and interests in Television Industry.</p>\n<p>Han combines academic training in television with professional experience in the media industry to launch a future career in entertainment management.<br>\nHan received a bachelor’s degree from the Communication University of China, majoring in broadcast television. She acquired solid academic knowledge through courses like TV Program Planning, News Theory, and Communication Research Methods during her undergraduate studies.<br>\n<img src=\"images/aboutme/cuc.jpg\" alt=\"CUC\" loading=\"lazy\"></p>\n<p>She also studied at the University of California, Santa Barbara, as a communication and media exchange student during her Sophomore year.<br>\n<img src=\"images/aboutme/sb.jpg\" alt=\"Santa Barbara\" loading=\"lazy\"></p>\n<p>In 2019, Han joined Sony Pictures Television in Beijing as a development intern. She engaged in the China-Russia cooperated TV project Chosen II, contributed to the screenwriting and Chinese-English translation; helped it reach 629,000 online views. She analyzed several ongoing and upcoming TV projects and conducted research on trending topics, including PTSD, the Esports industry, and young adults’ attitudes towards love.<br>\n<img src=\"images/aboutme/sony.jpg\" alt=\"Sony\" loading=\"lazy\"></p>\n<p>Earlier, Han was a business development intern at Tencent Technology Enterprise (Beijing). She took charge of the Internet celebrity business development for the QQ Kandian platform, reaching more than 1,000 influencers from TikTok, Kwai, and Weibo. She collaborated on several top business projects, independently hosting 16 up-to-date discussions and inspiring celebrities to create more than 1,300 original social media posts.<br>\nHan also worked as a freelance promotion planner to help companies including RED, Youku, and FaceU successfully publicize media products and television shows.<br>\n<img src=\"images/aboutme/cuc2.jpg\" alt=\"CUC\" loading=\"lazy\"></p>\n<p>Han is currently pursuing a master’s degree in marketing communication research at Boston University. Besides rich knowledge in marketing communication, she is still pursuing a certificate in data analysis from the Computer Science Department. Understanding coding rules then applying them to real-world problems could be challenging. Still, she successfully learned methods like implementing regression models to investigate complicated social issues like mental health. She is also qualified to measure how much one aspect like alcohol or family heredity affects depression and then evades it through strategic recognition.<br>\nWhen chasing academia, she is also concerned about the unpredictable market in authentic situations. During her work as a marketing internship in Bilibili technology company, she analyzed influencers’ content on Bilibili, managed and supervised the quality, time, and cost of projects. She also developed outstanding skills in communication with influencers and clients, who comes from Gaming (Honor of Kings, Fantasy Westward Journey), Cosmetics (Elizabeth Arden, La Mer, and Innisfree) to Technology (Dell, Intel, and MAO KING).<br>\n<img src=\"images/aboutme/b3.jpg\" alt=\"Han in Bilibili\" loading=\"lazy\"><br>\n(Han starred in Bilibili 2021 social recruitment promotion video, full video:<a href=\"https://www.bilibili.com/video/BV1cT4y1Z79K?spm_id_from=333.999.0.0\">https://www.bilibili.com/video/BV1cT4y1Z79K?spm_id_from=333.999.0.0</a>)</p>\n<p>Now, Han is looking forward to a future path in both academia and industry.</p>\n","prev":{"title":"Conventional Report on Disney+","link":"2021/11/25/disney"},"next":{"title":"Learn from Kpop Female Groups","link":"2021/04/11/kpopgroup"},"plink":"http://example.com/2021/09/10/aboutme/","reading_time":"472 words in 3 min"}