{"title":"Learn from Kpop Female Groups","date":"2021-04-11T07:50:32.000Z","date_formatted":{"ll":"Apr 11, 2021","L":"04/11/2021","MM-DD":"04-11"},"thumbnail":"2021/04/11/kpopgroup/kpoptitle.jpeg","link":"2021/04/11/kpopgroup","tags":["Kpop"],"updated":"2021-12-23T06:18:33.670Z","content":"<h2 id=\"brave-girls-be-brave\">Brave Girls-Be Brave<a title=\"#brave-girls-be-brave\" href=\"#brave-girls-be-brave\"></a></h2>\n<p>I was shocked when I woke up on March 4 and saw “Rollin” trending on the top sector of Weibo. When I clicked the hashtag, a video popped up. I couldn’t believe it was exactly the song I listened to almost four years ago. As a 13-year Kpop lover, I always follow the latest music trends and check every week’s latest performance stages. Hundreds of groups debuted in South Korea every year, and numerous songs came out, but most of them only went nameless. The song “Rollin” was one of those unknown songs.<br>\n<img src=\"images/bg1.jpg\" alt=\"Brave Girls Orignal Concept is \" loading=\"lazy\"><br>\n(The original concept of “Rollin” is Sexy)</p>\n<p>A YouTuber named “비디터ᴠɪᴅɪᴛᴏʀ” edited Brave Girls’ live stages and combined it with interactive comments under those performance videos. He of she uploaded it on February 24. (See more on: <a href=\"https://www.youtube.com/watch?v=cfHWIqJkEf4\">https://www.youtube.com/watch?v=cfHWIqJkEf4</a>)<br>\nA few days later, more and more people gathered. Most of them have served in South Korea’s army before.<br>\nThousands of South Korean soldiers loved this song mainly because of Brave Girls’ endless effort and their passion for the stage.<br>\n<img src=\"images/bg3.jpg\" alt=\"A Screenshot of the Popular Video\" loading=\"lazy\"></p>\n<p>Performing in the military is an energy-consuming job with little salary but long-time travel. Most of the famous female groups only attended no more than three shows. However, BraveGirls attended almost all of them. Their longest journey took 12 hours, and the payback was less than $80. Despite the difficulties, every time, Brave Girls smiled and enjoyed the performance “as if it’s the last.”<br>\nFor example, to perform the song “Rollin”, everyone should dance on a chair. One time, the group member Yuna fell from the chair during the performance. She quickly got up and stood on the chair again, perfectly finishing the song.<br>\n<img src=\"images/bg2.jpg\" alt=\"Live Performance\" loading=\"lazy\"><br>\n(During the performance, BraveGirls need to dance on the chair.)</p>\n<p>All of a sudden, a miracle happened.<br>\nUntil March 24 24.00 pm (Korean Time), this song has achieved the “perfect all-kill” 244 times, ranking fourth on South Korea’s all-time history music chart. Also, I have to admit it’s the most harmonious time in the last decade of Kpop fan clubs: Everyone supported BraveGirls’ return and cheered for their success.<br>\nIt’s unbelievable in Kpop history.<br>\nBrave Girls did it.</p>\n<p>The most significant factor to their late success is always their love for the stage and their braveness.<br>\nThey persisted and never gave up.<br>\n<img src=\"images/bg4.jpg\" alt=\"BraveGirls on 2021 MMA\" loading=\"lazy\"><br>\nSo have you heard any of Brave Girls’ songs? Which one is your favorite?</p>\n<hr>\n<h2 id=\"dreamcatcher--be-what-you-wanna-be\">Dreamcatcher -Be what you wanna be<a title=\"#dreamcatcher--be-what-you-wanna-be\" href=\"#dreamcatcher--be-what-you-wanna-be\"></a></h2>\n<p>I became fascinated with Dreamcatcher’s concept since its debut. As the first and ever Kpop female rock group, I knew from the beginning that Dreamcatcher was destined to a tough road.<br>\nFormerly known as Minx, the five-member girl group debuted in 2014. They followed the significant trends, sang sweet love songs, and were just a flash in the pan. In 2017, with two new members, the group re-debut under the name Dreamcatcher.<br>\n<img src=\"images/dc1.jpg\" alt=\"Orignal concept of Minx\" loading=\"lazy\"><br>\n(Original concept of Minx is Cute)</p>\n<p>I didn’t notice the group Minx before, but the fresh style of Dreamcatcher immediately caught my attention. This time, they abandoned the popular trend: Girl crush or sweet melody, they stuck to the rock-band style pop song with the concept of “Nightmare.” Their songs are unique in Kpop history since no one did before, and it’s nearly a rebellion against the traditional aesthetic standard for Kpop female groups.<br>\n<img src=\"images/dc4.jpg\" alt loading=\"lazy\"></p>\n<p>Traditional beliefs like “Female groups should be sweet” or “It’s weird for female groups to perform rock songs on stage” even confused some of the members initially. I remember the main vocal, Siyeon, once talked about her anxiety after deciding the concept: “Though I love singing rock songs, is this the right path?”<br>\n<img src=\"images/dc2.jpg\" alt=\"Chase Me\" loading=\"lazy\"><br>\n(Dreamcatcher’s debut song: Chase Me. You can watch the official video on: <a href=\"https://www.youtube.com/watch?v=zihoyz0u_cs\">https://www.youtube.com/watch?v=zihoyz0u_cs</a>)</p>\n<p>Surprisingly, Dreamcatcher’s songs went popular in South America and Europe. For example, after releasing their second album and their first EP “Prequel,” the album debuted at No. 5 on the Billboard World Albums Chart and peaked at No. 1 on the US iTunes K-Pop Top 100 Chart.<br>\nDreamcatcher’s album sales have reached more than 100.000, and they have toured more than 20 countries. Though they haven’t won the first prize in South Korea’s music shows, I believe more and more people will discover their uniqueness and support them as long as they stick to who they want to become.<br>\n“We are Insomnia; we don’t sleep on talents.”<br>\n<img src=\"images/dc3.jpg\" alt=\"Whole Group\" loading=\"lazy\"></p>\n<p>Do you love listening to rock songs in your spare time? Have you “tried” Dreamcatcher’s songs before?</p>\n<hr>\n<h2 id=\"girls'-generation--never-stop-chasing-for-the-perfect\">Girls’ Generation- Never stop chasing for the perfect<a title=\"#girls'-generation--never-stop-chasing-for-the-perfect\" href=\"#girls'-generation--never-stop-chasing-for-the-perfect\"></a></h2>\n<p>I am a Kpop lover. To be specific, I am a superfan of Kpop female groups.<br>\nI searched for “which celebrity has the same birthday with you” when I found “Taeyeon,” the group leader of Girls’ Generation. That’s the beginning and the reason why I began to know Kpop.<br>\n<img src=\"images/gg1.jpg\" alt=\"GG\" loading=\"lazy\"><br>\n(Girls’ Generation debuted on August 5, 2017)</p>\n<p>Expressing your love for female groups sometimes creates confusion and misunderstanding. People asked me: You are a girl. Why do you love female idols? I was offended when I was young, but now I realize that I shouldn’t be embarrassed about what I love. So I told them I support female Kpop groups because I cherish the braveness, talents, and endless effort they devote to become perfect in their career.<br>\n<img src=\"images/gg4.jpg\" alt=\"GG2\" loading=\"lazy\"></p>\n<p>An important factor about South Korea’s Kpop culture is their trainee culture. To become a qualified idol, teenagers have to practice three to four years, and some trainees like Sunny from Girls’ Generation may even need to practice seven years to stand on the stage finally. Meanwhile, females always have to work harder to stand out among their peers, and it’s more difficult for them to debut in the ferocious entertainment industry successfully.<br>\nAt the same time, few female groups could stand the test of time. Compared with male groups who have to finish the mandatory military service in South Korea, only a few female groups could last longer than seven years.<br>\nThat’s why someone said Girls’ Generation “extended the average ‘lifetime’ of Kpop female groups.”<br>\n<img src=\"images/gg3.jpg\" alt=\"GG3\" loading=\"lazy\"></p>\n<p>Girls’ Generation has debuted 14 years, and the group is known for being one of the prominent South Korean figures and one of the most popular Kpop groups worldwide. It has earned numerous accolades and the honorific nickname “The Nation’s Girl Group” in South Korea.<br>\nCurrently, every member is dedicated to a specific area they love, like singing, hosting, acting, musical, and cooking. They proved that females could do everything as long as they sought the opportunity and stuck to their purpose.<br>\nThe group’s central dancer, Hyoyeon, once talked about her group members on a show: “In fact, every one of us has different characteristics, and sometimes conflicts occur. However, as a group, we have the same purpose, and that’s what unites us.” Another member Sooyoung also agreed; she talked about what inspired her has always been “the spirit of Girls’ Generation.”<br>\n<img src=\"images/gg2.jpg\" alt=\"GG4\" loading=\"lazy\"></p>\n<p>So what’s the spirit of the Girls’ Generation?<br>\nNever stop chasing for the perfect.</p>\n<p>Do you know other female groups’ spirits? Feel free to share yours under the comment box below.</p>\n<p>[This passage was initially written on March 25th, 2021, for course CM707; the recent edit is on April 11th.]</p>\n","prev":{"title":"Biography of HANN","link":"2021/09/10/aboutme"},"next":{"title":"One-to-One Interview with Actress Xin Zhang","link":"2021/04/09/qa"},"plink":"http://example.com/2021/04/11/kpopgroup/","toc":[{"id":"brave-girls-be-brave","title":"Brave Girls-Be Brave","index":"1"},{"id":"dreamcatcher--be-what-you-wanna-be","title":"Dreamcatcher -Be what you wanna be","index":"2"},{"id":"girls'-generation--never-stop-chasing-for-the-perfect","title":"Girls’ Generation- Never stop chasing for the perfect","index":"3"}],"reading_time":"1306 words in 9 min"}