{"title":"One-to-One Interview with Actress Xin Zhang","date":"2021-04-09T08:30:37.000Z","date_formatted":{"ll":"Apr 9, 2021","L":"04/09/2021","MM-DD":"04-09"},"thumbnail":"2021/04/09/qa/01.jpg","link":"2021/04/09/qa","tags":["interview"],"updated":"2021-12-23T10:09:34.297Z","content":"<p>Original Title: The Life of a “Middle Line” Actress</p>\n<p>Xin Zhang is a 25-year-old Chinese actress and singer. She graduated from the Beijing Film Academy, debuted in 2016 and became an actress till now. She has acted in television dramas like “Arsenal Military Academy”, &quot;The Legends” and “Detective”.<br>\n<img src=\"images/kim/09.jpg\" alt loading=\"lazy\"></p>\n<p><em>Q: It’s been a while since our last conversation. How’s your going recently?</em></p>\n<p>I just finished shooting one TV series called: “Snow Lover” and went back home to take some rest. I acted as the supporting actress in this opera and my character was a “nobody” actress named Lin Jinjin, quite similar to my current situation.</p>\n<p><em>Yeah, but you got 2 million followers on Weibo which seems far more than “nobody”, right?</em></p>\n<p>You can say that, if you see from this perspective. Personally, I would view myself as those who are in the middle line: not so famous but also not that anonymous. Sometimes my schedule would be really busy and sometimes I could be unemployed for more than six months. It’s also another factor that triggered my anxiety last year since all my work was shut down due to the pandemic.</p>\n<p><em>I got it. So what’s your original plan if the pandemic didn’t occur?</em></p>\n<p>The ski-set TV drama “Snow Lover” was supposed to be shot in the winter vacation of 2020. However, due to the pandemic, the snow had already melted by the time I could go out, so it was postponed. Later, I planned to act in a modern TV drama in September while the skiing drama suddenly notified me that it would start shooting in November. So the two dramas bumped their schedules, and I had to give up the latter. Sadly, the “Snow Lover” didn’t start filming until last December and I was so anxious during the waiting. You know, actors are not like other jobs which you can do freelance work while you are unemployed. In such circumstances, we can do nothing but wait.<br>\n<img src=\"images/kim/10.jpg\" alt loading=\"lazy\"></p>\n<p><em>Yes, acting is not as adjustable as other occupations. I noticed that you had covered a lot of songs on Tiktok during those days. I assumed that singing could help you relieve yourself, right?</em></p>\n<p>Yes, of course. Music is like my secret weapon. When I am singing, I can focus on my lyrics and my feelings. I won’t be bothered by anything else, it helps clear my mind. I always bring the guitar with me even though I have a shooting schedule: piano and guitar are my friends, they could help me compose and accompany me forever.<br>\n<img src=\"images/kim/11.jpg\" alt loading=\"lazy\"></p>\n<p><em>I have also played the piano since childhood, I understand such feelings. You also wrote the song “UR” for the drama “Detective” which sounds so beautiful to me. The drama “Detective” is also your first time acting as the leading role, do you have some special experiences or memories to share with me?</em></p>\n<p>Thank you for your support. Most of the time, I talk about other actors and actresses during interviews, like what I have learnt from them and how we helped each other. In fact, the person who influenced me most is the styling designer assistant. I could tell she was younger than me from her appearance. Everyday she helped me with my styling during the shooting. For example, if my hair was messed up by the wind or my clothes were uneven, she would immediately fix it for me. On the wrap day, after my last scene, she asked me if she could have a picture with me and I said yes. When we stood together and began to take pictures, she suddenly noticed that my hair was a bit messy and she quickly helped me fix it even though I didn’t have any shooting schedule later. She loved her job so much and I was touched by her subconscious behavior. I wish she could have a brilliant future.<br>\n<img src=\"images/kim/14.jpg\" alt loading=\"lazy\"></p>\n<p><em>I’m sure she will. So how does it feel when you could act as the leading role in one drama for the first time in your life?</em></p>\n<p>I was a bit worried at first but I became ambitious about it. Acting as the leading role means your character would be more “deep” and “solid” since the playwright would focus more on your role. The role would have more lines and the actor could have more “belief” in their characters. I mean, take my last character Lin Jinjin for example, sometimes I don’t see the reason why she behaved like this. I was shooting in a scene of Lin quarreling with her boyfriend on the day you paid a visit. I  was confused about the reason why the two characters suddenly reunited. What’s more, there were so many kissing scenes which seemed quite inappropriate for me. I mean, I don’t mind having kissing scenes during the shooting, but kissing after saying one sentence was so strange and that made it hard for me to immerse in the character.<br>\n<img src=\"images/kim/02.jpg\" alt loading=\"lazy\"></p>\n<p><em>Right, I remembered you look really tired that day but the audience may not know because they will only see actors dressed elegantly and starring on the screen.<br>\nNowadays, many teenagers want to become stars or show up on TV. Do you have any recommendations or advice for them?</em></p>\n<p>Personally, I would say being an actress is an ordinary occupation just like others. The main difference may be we appear on the screen more often than others but it doesn’t mean it’s a simple job with no sweat. I welcome anyone who has acting dreams but you may need to think deeper before stepping into this industry.<br>\n<img src=\"images/kim/12.jpg\" alt loading=\"lazy\"></p>\n<p><em>Thank you so much for your time!</em></p>\n<hr>\n","prev":{"title":"Learn from Kpop Female Groups","link":"2021/04/11/kpopgroup"},"plink":"http://example.com/2021/04/09/qa/","reading_time":"977 words in 7 min"}